---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.GetMaterialIds
source: html/f4777226-92aa-d37b-63cd-d7b76358b4ae.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.GetMaterialIds Method

Returns a list of ids of the associated materials to analytical construction.

## Syntax (C#)
```csharp
public IList<ElementId> GetMaterialIds()
```